app/controllers/reviews_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    product = Product.find(params[:product_id])

INSERT INTO "reviews" ("title", "content", "author", "created_at", "updated_at", "product_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Hello"], ["content", "Hello Hello"], ["author", "Sean"], ["created_at", "2021-02-25 04:49:19.264886"], ["updated_at", "2021-02-25 04:49:19.264886"], ["product_id", 1]]
---
  def create
    @review = Review.new(review_params)

    if @review.save

UPDATE "reviews" SET "title" = $1, "content" = $2, "author" = $3, "updated_at" = $4 WHERE "reviews"."id" = $5  [["title", "Hello 2"], ["content", "Hello Hello"], ["author", "Sean"], ["updated_at", "2021-02-25 04:57:56.991313"], ["id", 1]]
---
  def update
    if @review.update(review_params)